import generateSentences from './generator';

const words = [
  'أنا', 'أنت', 'هو', 'هي', 'نحن', 'أنتم', 'يذهب', 'يريد', 'يأكل', 'يشرب',
  'يعمل', 'طفل', 'كلب', 'قط', 'بيت', 'مدرسة', 'شقة', 'طاولة', 'كرسي',
  'بحر', 'شمس', 'سريع', 'بطيء', 'جميل', 'كبير', 'صغير', 'جديد', 'قديم', 'يوم',
  'ليل', 'صباح', 'مساء', 'أسبوع', 'شهر', 'سنة', 'أحمر', 'أزرق', 'أخضر',
  'ملون', 'سماء', 'أرض', 'عيد', 'متعة', 'أصدقاء', 'عائلة', 'رحلة', 'موسيقى',
  'يتعلم', 'يكتب', 'يقرأ', 'يتناول', 'يشرب', 'يجري', 'يتحدث', 'يتجول', 'يتمرن',
  'أسئلة', 'إجابات', 'تفاح', 'خبز', 'قهوة', 'شاي', 'حليب', 'ماء', 'يسافر',
  'يقف', 'يجلس', 'يشعل', 'يطفي', 'يضحك', 'يبكي', 'يستمع', 'يتذكر', 'ينسى',
  'يرسم', 'يبني', 'يحلم', 'يفكر', 'كرة', 'زفاف', 'دراسة', 'عطلة',
  'رجل', 'امرأة', 'أطفال', 'عمل', 'هدية', 'قصة', 'لعبة', 'صورة',
  'متجر', 'حديقة', 'بستان', 'مكان', 'زهرة', 'شجرة', 'دفتر', 'قلم رصاص',
  'قلم', 'ورق', 'حاسوب', 'هاتف'
];

const prepositions = [
  'في', 'من', 'مع', 'بدون', 'تحت', 'فوق', 'قرب', 'بين', 'حول', 'عبر'
];

const sentences = generateSentences(words, ' ', prepositions);

export default sentences;
