import generateSentences from './generator';

const words = [
  '我', '你', '他', '她', '我们', '你们', '去', '想', '吃', '喝',
  '工作', '孩子', '狗', '猫', '房子', '学校', '公寓', '桌子', '椅子',
  '海', '太阳', '快', '慢', '漂亮', '大', '小', '新', '旧', '白天',
  '夜晚', '早上', '晚上', '周', '月', '年', '红色', '蓝色', '绿色',
  '彩色', '天空', '土地', '节日', '快乐', '朋友', '家人', '旅行', '音乐',
  '学习', '写', '读', '吃饭', '喝水', '跑步', '说话', '散步', '锻炼',
  '问题', '答案', '苹果', '面包', '咖啡', '茶', '牛奶', '水', '开车',
  '站立', '坐下', '打开', '关闭', '笑', '哭', '听', '记得', '忘记',
  '画画', '建造', '梦想', '思考', '球', '婚礼', '学习', '假期',
  '男人', '女人', '孩子们', '工作', '礼物', '故事', '游戏', '图片',
  '商店', '公园', '花园', '地方', '花', '树', '笔记本', '铅笔',
  '笔', '纸', '电脑', '电话'
];

const prepositions = [
  '在', '从', '和', '没有', '下', '上', '附近', '之间', '周围', '通过'
];

const sentences = generateSentences(words, '', prepositions);

export default sentences;
