const words = [
  'אני', 'אתה', 'הוא', 'היא', 'אנחנו', 'אתם', 'הולך', 'רוצה', 'לאכול', 'לשתות',
  'עובד', 'ילד', 'ילדה', 'כלב', 'חתול', 'בית', 'ספר', 'דירה', 'שולחן', 'כיסא',
  'ים', 'שמש', 'מהיר', 'לאט', 'יפה', 'גדול', 'קטן', 'חדש', 'ישן', 'יום',
  'לילה', 'בוקר', 'ערב', 'שבוע', 'חודש', 'שנה', 'אדום', 'כחול', 'ירוק',
  'צבעוני', 'שמיים', 'אדמה', 'חג', 'כיף', 'חברים', 'משפחה', 'טיול', 'מוזיקה',
  'לומדים', 'כותבים', 'קוראים', 'אוכלים', 'שותים', 'רצים', 'מדברים',
  'מטיילים', 'מתאמנים', 'שאלות', 'תשובות', 'תפוח', 'לחם', 'קפה', 'תה',
  'חלב', 'מים', 'נוסעים', 'עומדים', 'יושבים', 'מדליקים', 'מכבים', 'צוחקים',
  'בוכים', 'מקשיבים', 'זוכרים', 'שוכחים', 'מציירים', 'בונים', 'חולמים',
  'חושבים', 'כדור', 'חתונה', 'לימודים', 'חופשה', 'איש', 'אישה', 'ילדים',
  'עבודה', 'מתנה', 'סיפור', 'משחק', 'תמונה', 'חנות', 'גן', 'גינה', 'שטח',
  'פרח', 'עץ', 'מחברת', 'עפרון', 'עט', 'נייר', 'מחשב', 'טלפון',
];

function randomSentence(): string {
  const arr: string[] = [];
  for (let i = 0; i < 10; i++) {
    const word = words[Math.floor(Math.random() * words.length)];
    arr.push(word);
  }
  return arr.join(' ');
}

const sentences: string[] = Array.from({ length: 1000 }, randomSentence);

export default sentences;
