const words = [
  'मैं', 'तुम', 'वह', 'हम', 'आप', 'वे', 'जाना', 'चाहना', 'खाना', 'पीना',
  'काम', 'बच्चा', 'कुत्ता', 'बिल्ली', 'घर', 'स्कूल', 'अपार्टमेंट', 'मेज़', 'कुर्सी',
  'समुद्र', 'सूरज', 'तेज़', 'धीमा', 'सुंदर', 'बड़ा', 'छोटा', 'नया', 'पुराना', 'दिन',
  'रात', 'सुबह', 'शाम', 'सप्ताह', 'महीना', 'साल', 'लाल', 'नीला', 'हरा', 'रंगीन',
  'आसमान', 'धरती', 'त्योहार', 'मज़ा', 'दोस्त', 'परिवार', 'यात्रा', 'संगीत',
  'पढ़ना', 'लिखना', 'दौड़ना', 'बोलना', 'चलना', 'व्यायाम', 'सेब', 'रोटी',
  'काफी', 'चाय', 'दूध', 'पानी'
];

function randomSentence(): string {
  const arr: string[] = [];
  for (let i = 0; i < 10; i++) {
    const word = words[Math.floor(Math.random() * words.length)];
    arr.push(word);
  }
  return arr.join(' ');
}

const sentences: string[] = Array.from({ length: 1000 }, randomSentence);

export default sentences;
