const words = [
  'నేను', 'నీవు', 'అతను', 'ఆమె', 'మనం', 'మీరు', 'వారు', 'వెల్లడం', 'కావడం', 'తినటం',
  'తాగటం', 'పని', 'పిల్ల', 'కుక్క', 'పిల్లి', 'ఇల్లు', 'పాఠశాల', 'అపార్ట్‌మెంట్', 'మెజ', 'కుర్చీ',
  'సముద్రం', 'సూర్యుడు', 'వేగంగా', 'నెల్లగా', 'అందమైన', 'పెద్ద', 'చిన్న', 'కొత్త', 'పాత', 'దినం',
  'రాత్రి', 'ఉదయం', 'సాయంత్రం', 'వారం', 'నెల', 'సంవత్సరం', 'ఎరుపు', 'నీలం', 'ఆకుపచ్చ', 'రంగురంగుల',
  'ఆకాశం', 'భూమి', 'పండుగ', 'సంతోషం', 'స్నేహితులు', 'కుటుంబం', 'ప్రయాణం', 'సంగీతం'
];

function randomSentence(): string {
  const arr: string[] = [];
  for (let i = 0; i < 10; i++) {
    const word = words[Math.floor(Math.random() * words.length)];
    arr.push(word);
  }
  return arr.join(' ');
}

const sentences: string[] = Array.from({ length: 1000 }, randomSentence);

export default sentences;
